smppandi1998/Daily-work/mcci-catena/ArduinoCore-samd-master/ArduinoCore-samd-master/boards.txt
#### end of configuration info for MCCI Catena 4420

#
# Configuration information for MCCI Catena 4450 boards
#
mcci_catena_4450.name=MCCI Catena 4450
mcci_catena_4450.upload.tool=bossac
mcci_catena_4450.upload.protocol=sam-ba
mcci_catena_4450.upload.maximum_size=262144
mcci_catena_4450.upload.use_1200bps_touch=true
mcci_catena_4450.upload.wait_for_upload_port=true
mcci_catena_4450.upload.native_usb=true
mcci_catena_4450.build.mcu=cortex-m0plus
mcci_catena_4450.build.f_cpu=48000000L
mcci_catena_4450.build.usb_product="MCCI Catena 4450"
mcci_catena_4450.build.usb_manufacturer="MCCI Corporation"
mcci_catena_4450.build.board=MCCI_CATENA_4450
mcci_catena_4450.build.core=arduino
mcci_catena_4450.build.extra_flags=-DARDUINO_SAMD_ZERO -DARDUINO_SAMD_FEATHER_M0 -DMCCI_CATENA_4450 -D__SAMD21G18A__ {build.usb_flags} {build.lorawan_flags} {build.lorawan_network_flags} {build.lorawan_subband_flags}
# mcci_catena_4450.build.c.Werror=
# mcci_catena_4450.build.cpp.Werror=
# mcci_catena_4450.build.S.Werror=
mcci_catena_4450.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
mcci_catena_4450.build.openocdscript=openocd_scripts/arduino_zero.cfg
mcci_catena_4450.build.variant=feather_m0_express
mcci_catena_4450.build.variant_system_lib=
mcci_catena_4450.build.vid=0x040E
mcci_catena_4450.build.pid=0x0031
mcci_catena_4450.bootloader.tool=openocd
mcci_catena_4450.bootloader.file=feather/samd21_sam_ba.bin
#
# menu.lorawan_region
mcci_catena_4450.menu.lorawan_region.us915=North America 915 MHz
mcci_catena_4450.menu.lorawan_region.eu868=Europe 868 MHz
mcci_catena_4450.menu.lorawan_region.au915=Australia 915 MHz
mcci_catena_4450.menu.lorawan_region.as923=Asia 923 MHz
mcci_catena_4450.menu.lorawan_region.as923jp=Japan 923 MHz
mcci_catena_4450.menu.lorawan_region.kr920=Korea 920 MHz
mcci_catena_4450.menu.lorawan_region.in866=India 866 MHz
mcci_catena_4450.menu.lorawan_region.projcfg=Use arduino-lmic/project_config/lmic_project_lmic_config_preconditions.h
mcci_catena_4450.menu.lorawan_region.us915.build.lorawan_flags=-DCFG_us915=1 -DCFG_sx1276_radio=1 -DARDUINO_LMIC_PROJECT_CONFIG_H=lmic_config_preconditions.h
mcci_catena_4450.menu.lorawan_region.eu868.build.lorawan_flags=-DCFG_eu868=1 -DCFG_sx1276_radio=1 -DARDUINO_LMIC_PROJECT_CONFIG_H=lmic_config_preconditions.h
mcci_catena_4450.menu.lorawan_region.au915.build.lorawan_flags=-DCFG_au915=1 -DCFG_au921=1 -DCFG_sx1276_radio=1 -DARDUINO_LMIC_PROJECT_CONFIG_H=lmic_config_preconditions.h
mcci_catena_4450.menu.lorawan_region.as923.build.lorawan_flags=-DCFG_as923=1 -DCFG_sx1276_radio=1 -DARDUINO_LMIC_PROJECT_CONFIG_H=lmic_config_preconditions.h
mcci_catena_4450.menu.lorawan_region.as923jp.build.lorawan_flags=-DCFG_as923=1 -DLMIC_COUNTRY_CODE=LMIC_COUNTRY_CODE_JP -DCFG_sx1276_radio=1 -DARDUINO_LMIC_PROJECT_CONFIG_H=lmic_config_preconditions.h
mcci_catena_4450.menu.lorawan_region.kr920.build.lorawan_flags=-DCFG_kr920=1 -DCFG_sx1276_radio=1 -DARDUINO_LMIC_PROJECT_CONFIG_H=lmic_config_preconditions.h
mcci_catena_4450.menu.lorawan_region.in866.build.lorawan_flags=-DCFG_in866=1 -DCFG_sx1276_radio=1 -DARDUINO_LMIC_PROJECT_CONFIG_H=lmic_config_preconditions.h
mcci_catena_4450.menu.lorawan_region.projcfg.build.lorawan_flags=

#
# menu.lorawan_network
mcci_catena_4450.menu.lorawan_network.ttn=The Things Network
mcci_catena_4450.menu.lorawan_network.ttn.build.lorawan_network_flags=-DARDUINO_LMIC_CFG_NETWORK_TTN=1
mcci_catena_4450.menu.lorawan_network.actility=Actility ThingsPark
mcci_catena_4450.menu.lorawan_network.actility.build.lorawan_network_flags=-DARDUINO_LMIC_CFG_NETWORK_ACTILITY=1
mcci_catena_4450.menu.lorawan_network.helium=Helium
mcci_catena_4450.menu.lorawan_network.helium.build.lorawan_network_flags=-DARDUINO_LMIC_CFG_NETWORK_HELIUM=1
mcci_catena_4450.menu.lorawan_network.machineq=machineQ
mcci_catena_4450.menu.lorawan_network.machineq.build.lorawan_network_flags=-DARDUINO_LMIC_CFG_NETWORK_MACHINEQ=1
mcci_catena_4450.menu.lorawan_network.senet=Senet
mcci_catena_4450.menu.lorawan_network.senet.build.lorawan_network_flags=-DARDUINO_LMIC_CFG_NETWORK_SENET=1
mcci_catena_4450.menu.lorawan_network.senra=Senra
mcci_catena_4450.menu.lorawan_network.senra.build.lorawan_network_flags=-DARDUINO_LMIC_CFG_NETWORK_SENRA=1
mcci_catena_4450.menu.lorawan_network.swisscom=Swisscom
mcci_catena_4450.menu.lorawan_network.swisscom.build.lorawan_network_flags=-DARDUINO_LMIC_CFG_NETWORK_SWISSCOM=1
mcci_catena_4450.menu.lorawan_network.chirpstack=ChirpStack
mcci_catena_4450.menu.lorawan_network.chirpstack.build.lorawan_network_flags=-DARDUINO_LMIC_CFG_NETWORK_CHIRPSTACK=1
mcci_catena_4450.menu.lorawan_network.generic=Generic
mcci_catena_4450.menu.lorawan_network.generic.build.lorawan_network_flags=-DARDUINO_LMIC_CFG_NETWORK_GENERIC=1
mcci_catena_4450.menu.lorawan_network.projcfg=Use arduino-lmic/project_config/lmic_project_lmic_config_preconditions.h
mcci_catena_4450.menu.lorawan_network.projcfg.build.lorawan_network_flags=

#
# menul.lorawan_subband
mcci_catena_4450.menu.lorawan_subband.default=Default, works everywhere
mcci_catena_4450.menu.lorawan_subband.default.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=-1
mcci_catena_4450.menu.lorawan_subband.sb0=sb0, ch 0~7 (US/AU/CN470)
mcci_catena_4450.menu.lorawan_subband.sb0.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=0
mcci_catena_4450.menu.lorawan_subband.sb1=sb1, ch 8~15 (US/AU/CN470)
mcci_catena_4450.menu.lorawan_subband.sb1.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=1
mcci_catena_4450.menu.lorawan_subband.sb2=sb2, ch 16~23 (US/AU/CN470)
mcci_catena_4450.menu.lorawan_subband.sb2.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=2
mcci_catena_4450.menu.lorawan_subband.sb3=sb3, ch 24~31 (US/AU/CN470)
mcci_catena_4450.menu.lorawan_subband.sb3.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=3
mcci_catena_4450.menu.lorawan_subband.sb4=sb4, ch 32~39 (US/AU/CN470)
mcci_catena_4450.menu.lorawan_subband.sb4.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=4
mcci_catena_4450.menu.lorawan_subband.sb5=sb5, ch 40~47 (US/AU/CN470)
mcci_catena_4450.menu.lorawan_subband.sb5.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=5
mcci_catena_4450.menu.lorawan_subband.sb6=sb6, ch 48~55 (US/AU/CN470)
mcci_catena_4450.menu.lorawan_subband.sb6.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=6
mcci_catena_4450.menu.lorawan_subband.sb7=sb7, ch 56~63 (US/AU/CN470)
mcci_catena_4450.menu.lorawan_subband.sb7.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=7
mcci_catena_4450.menu.lorawan_subband.sb8=sb8, ch 64~71 (CN470)
mcci_catena_4450.menu.lorawan_subband.sb8.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=8
mcci_catena_4450.menu.lorawan_subband.sb9=sb9, ch 72~79 (CN470)
mcci_catena_4450.menu.lorawan_subband.sb9.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=9
mcci_catena_4450.menu.lorawan_subband.sb10=sb10, ch 80~87 (CN470)
mcci_catena_4450.menu.lorawan_subband.sb10.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=10
mcci_catena_4450.menu.lorawan_subband.sb11=sb11, ch 88~95 (CN470)
mcci_catena_4450.menu.lorawan_subband.sb11.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=11

#### end of configuration info for MCCI Catena 4450

#
# Configuration information for MCCI Catena 4460 boards
#
mcci_catena_4460.name=MCCI Catena 4460
mcci_catena_4460.upload.tool=bossac
mcci_catena_4460.upload.protocol=sam-ba
mcci_catena_4460.upload.maximum_size=262144
mcci_catena_4460.upload.use_1200bps_touch=true
mcci_catena_4460.upload.wait_for_upload_port=true
mcci_catena_4460.upload.native_usb=true
mcci_catena_4460.build.mcu=cortex-m0plus
mcci_catena_4460.build.f_cpu=48000000L
mcci_catena_4460.build.usb_product="MCCI Catena 4460"
mcci_catena_4460.build.usb_manufacturer="MCCI Corporation"
mcci_catena_4460.build.board=MCCI_CATENA_4460
mcci_catena_4460.build.core=arduino
mcci_catena_4460.build.extra_flags=-DARDUINO_SAMD_ZERO -DARDUINO_SAMD_FEATHER_M0 -DMCCI_CATENA_4460 -D__SAMD21G18A__ {build.usb_flags} {build.lorawan_flags} {build.lorawan_network_flags} {build.lorawan_subband_flags}
# mcci_catena_4460.build.c.Werror=
# mcci_catena_4460.build.cpp.Werror=
# mcci_catena_4460.build.S.Werror=
mcci_catena_4460.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
mcci_catena_4460.build.openocdscript=openocd_scripts/arduino_zero.cfg
mcci_catena_4460.build.variant=feather_m0_express
mcci_catena_4460.build.variant_system_lib=
mcci_catena_4460.build.vid=0x040E
mcci_catena_4460.build.pid=0x0051
mcci_catena_4460.bootloader.tool=openocd
mcci_catena_4460.bootloader.file=feather/samd21_sam_ba.bin
#
# menu.lorawan_region
mcci_catena_4460.menu.lorawan_region.us915=North America 915 MHz
mcci_catena_4460.menu.lorawan_region.eu868=Europe 868 MHz
mcci_catena_4460.menu.lorawan_region.au915=Australia 915 MHz
mcci_catena_4460.menu.lorawan_region.as923=Asia 923 MHz
mcci_catena_4460.menu.lorawan_region.as923jp=Japan 923 MHz
mcci_catena_4460.menu.lorawan_region.kr920=Korea 920 MHz
mcci_catena_4460.menu.lorawan_region.in866=India 866 MHz
mcci_catena_4460.menu.lorawan_region.projcfg=Use arduino-lmic/project_config/lmic_project_lmic_config_preconditions.h
mcci_catena_4460.menu.lorawan_region.us915.build.lorawan_flags=-DCFG_us915=1 -DCFG_sx1276_radio=1 -DARDUINO_LMIC_PROJECT_CONFIG_H=lmic_config_preconditions.h
mcci_catena_4460.menu.lorawan_region.eu868.build.lorawan_flags=-DCFG_eu868=1 -DCFG_sx1276_radio=1 -DARDUINO_LMIC_PROJECT_CONFIG_H=lmic_config_preconditions.h
mcci_catena_4460.menu.lorawan_region.au915.build.lorawan_flags=-DCFG_au915=1 -DCFG_au921=1 -DCFG_sx1276_radio=1 -DARDUINO_LMIC_PROJECT_CONFIG_H=lmic_config_preconditions.h
mcci_catena_4460.menu.lorawan_region.as923.build.lorawan_flags=-DCFG_as923=1 -DCFG_sx1276_radio=1 -DARDUINO_LMIC_PROJECT_CONFIG_H=lmic_config_preconditions.h
mcci_catena_4460.menu.lorawan_region.as923jp.build.lorawan_flags=-DCFG_as923=1 -DLMIC_COUNTRY_CODE=LMIC_COUNTRY_CODE_JP -DCFG_sx1276_radio=1 -DARDUINO_LMIC_PROJECT_CONFIG_H=lmic_config_preconditions.h
mcci_catena_4460.menu.lorawan_region.kr920.build.lorawan_flags=-DCFG_kr920=1 -DCFG_sx1276_radio=1 -DARDUINO_LMIC_PROJECT_CONFIG_H=lmic_config_preconditions.h
mcci_catena_4460.menu.lorawan_region.in866.build.lorawan_flags=-DCFG_in866=1 -DCFG_sx1276_radio=1 -DARDUINO_LMIC_PROJECT_CONFIG_H=lmic_config_preconditions.h
mcci_catena_4460.menu.lorawan_region.projcfg.build.lorawan_flags=

#
# menu.lorawan_network
mcci_catena_4460.menu.lorawan_network.ttn=The Things Network
mcci_catena_4460.menu.lorawan_network.ttn.build.lorawan_network_flags=-DARDUINO_LMIC_CFG_NETWORK_TTN=1
mcci_catena_4460.menu.lorawan_network.actility=Actility ThingsPark
mcci_catena_4460.menu.lorawan_network.actility.build.lorawan_network_flags=-DARDUINO_LMIC_CFG_NETWORK_ACTILITY=1
mcci_catena_4460.menu.lorawan_network.helium=Helium
mcci_catena_4460.menu.lorawan_network.helium.build.lorawan_network_flags=-DARDUINO_LMIC_CFG_NETWORK_HELIUM=1
mcci_catena_4460.menu.lorawan_network.machineq=machineQ
mcci_catena_4460.menu.lorawan_network.machineq.build.lorawan_network_flags=-DARDUINO_LMIC_CFG_NETWORK_MACHINEQ=1
mcci_catena_4460.menu.lorawan_network.senet=Senet
mcci_catena_4460.menu.lorawan_network.senet.build.lorawan_network_flags=-DARDUINO_LMIC_CFG_NETWORK_SENET=1
mcci_catena_4460.menu.lorawan_network.senra=Senra
mcci_catena_4460.menu.lorawan_network.senra.build.lorawan_network_flags=-DARDUINO_LMIC_CFG_NETWORK_SENRA=1
mcci_catena_4460.menu.lorawan_network.swisscom=Swisscom
mcci_catena_4460.menu.lorawan_network.swisscom.build.lorawan_network_flags=-DARDUINO_LMIC_CFG_NETWORK_SWISSCOM=1
mcci_catena_4460.menu.lorawan_network.chirpstack=ChirpStack
mcci_catena_4460.menu.lorawan_network.chirpstack.build.lorawan_network_flags=-DARDUINO_LMIC_CFG_NETWORK_CHIRPSTACK=1
mcci_catena_4460.menu.lorawan_network.generic=Generic
mcci_catena_4460.menu.lorawan_network.generic.build.lorawan_network_flags=-DARDUINO_LMIC_CFG_NETWORK_GENERIC=1
mcci_catena_4460.menu.lorawan_network.projcfg=Use arduino-lmic/project_config/lmic_project_lmic_config_preconditions.h
mcci_catena_4460.menu.lorawan_network.projcfg.build.lorawan_network_flags=

#
# menul.lorawan_subband
mcci_catena_4460.menu.lorawan_subband.default=Default, works everywhere
mcci_catena_4460.menu.lorawan_subband.default.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=-1
mcci_catena_4460.menu.lorawan_subband.sb0=sb0, ch 0~7 (US/AU/CN470)
mcci_catena_4460.menu.lorawan_subband.sb0.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=0
mcci_catena_4460.menu.lorawan_subband.sb1=sb1, ch 8~15 (US/AU/CN470)
mcci_catena_4460.menu.lorawan_subband.sb1.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=1
mcci_catena_4460.menu.lorawan_subband.sb2=sb2, ch 16~23 (US/AU/CN470)
mcci_catena_4460.menu.lorawan_subband.sb2.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=2
mcci_catena_4460.menu.lorawan_subband.sb3=sb3, ch 24~31 (US/AU/CN470)
mcci_catena_4460.menu.lorawan_subband.sb3.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=3
mcci_catena_4460.menu.lorawan_subband.sb4=sb4, ch 32~39 (US/AU/CN470)
mcci_catena_4460.menu.lorawan_subband.sb4.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=4
mcci_catena_4460.menu.lorawan_subband.sb5=sb5, ch 40~47 (US/AU/CN470)
mcci_catena_4460.menu.lorawan_subband.sb5.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=5
mcci_catena_4460.menu.lorawan_subband.sb6=sb6, ch 48~55 (US/AU/CN470)
mcci_catena_4460.menu.lorawan_subband.sb6.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=6
mcci_catena_4460.menu.lorawan_subband.sb7=sb7, ch 56~63 (US/AU/CN470)
mcci_catena_4460.menu.lorawan_subband.sb7.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=7
mcci_catena_4460.menu.lorawan_subband.sb8=sb8, ch 64~71 (CN470)
mcci_catena_4460.menu.lorawan_subband.sb8.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=8
mcci_catena_4460.menu.lorawan_subband.sb9=sb9, ch 72~79 (CN470)
mcci_catena_4460.menu.lorawan_subband.sb9.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=9
mcci_catena_4460.menu.lorawan_subband.sb10=sb10, ch 80~87 (CN470)
mcci_catena_4460.menu.lorawan_subband.sb10.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=10
mcci_catena_4460.menu.lorawan_subband.sb11=sb11, ch 88~95 (CN470)
mcci_catena_4460.menu.lorawan_subband.sb11.build.lorawan_subband_flags=-DARDUINO_LMIC_CFG_SUBBAND=11

